name: "post_processing"
backend: "python"
max_batch_size : 8

input [
    {
        name: "output__0"
        data_type: TYPE_FP32
        dims: [3]
    }
]

output [
    {
        name: "class"
        data_type: TYPE_STRING
        dims: [-1, 3]
    },
    {
        name: "prob"
        data_type: TYPE_FP32
        dims: [-1, 3]
    }
]