name: "distilbert"
platform: "pytorch_libtorch"
max_batch_size : 8

input [
    {
        name: "input_ids"
        data_type: TYPE_INT64
        dims: [-1]
    },
    {
        name: "attention_mask"
        data_type: TYPE_INT64
        dims: [-1]
    }
]

output [
    {
        name: "output__0"
        data_type: TYPE_FP32
        dims: [-1, -1, 768]
    }
]

dynamic_batching {
    max_queue_delay_microseconds: 1000000
}